Revit 2024 API
BaseExportOptions.GetExportLayerTable Method
 Gets the layer table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ExportLayerTable GetExportLayerTable()
Visual Basic
Public Function GetExportLayerTable As ExportLayerTable
Visual C++
public:
ExportLayerTable^ GetExportLayerTable()
Return Value
 The layer table.
See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace